app/controllers/workers_controller.rb

SELECT "workers".* FROM "workers"
---
  def index
    @workers = Worker.all

INSERT INTO "workers" ("department", "name", "password", "username") VALUES ($1, $2, $3, $4) RETURNING "id"  [["department", "deptB"], ["name", "Jacob Brub"], ["password", "1a1dc91c907325c69271ddf0c944bc72"], ["username", "jbrub"]]
---
  def create
    require "digest/md5"
    pass = Digest::MD5.hexdigest(params[:password])
    Worker.create(:name => params[:name],
      :username => params[:username],
      :password => pass,
      :department => params[:department])